package lesson_4_collections;

//        Создать класс Person: Фамилия, Имя, Отчество, Дата рождения, Адрес, Телефон.
//        переопределить метод toString()
//        Класс Student унаследовать класса Person: id, Адрес, Телефон, Факультет, Курс, Группа.
//        переопределить метод toString()
//        Создать класс University с полями Название, Список студентов переопределить метод toString()
//        В классе University создать методы для получения:
//        a) списка студентов заданного факультета;
//        b) списка студентов для каждого факультета и курса;
//        c) списка студентов, родившихся после заданного года;
//        d) списка учебной группы.

public class Main {
    public static void main(String[] args) {

    }
}
